[
    "Parcourir la carte SD",
    "Parcourir la mémoire de la console",
    "Installations USB",
    "Gérer le contenu de la console",
    "Gérer les tickets sur la console",
    "Naviguer sur Internet",
    "Gérer les comptes utilisateurs",
    "Voir les informations de la console",
    "A propos de Goldleaf",
    "Parcourir les fichiers et dossiers de la carte SD",
    "Parcourir la mémoire de la console et le contenu des partitions.",
    "Installer des NSPs via USB depuis Quark ou autres clients sur PC.",
    "Parcourir et naviguer tout le contenu ou tous les titres de la console.",
    "Parcourir tous les tickets du contenu acheté ou installé.",
    "Naviguer sur Internet en utilisant l'applet web de la console.",
    "Sélectionner un compte utilisateur pour le gérer.",
    "Voir des informations sur le statuts de la mémoire de la console et de la carte SD.",
    "Voir la version de Goldleaf, le mode de lancement et le logo",
    "Annuler",
    "Carte SD",
    "Mémoire de la console",
    "Quelle partition de la mémoire de la console voulez vous parcourir ?",
    "PRODINFOF contiens plusieurs journaux de tests et autres contenus.",
    "NAND SAFE ne contient rien d'exploitable.",
    "NAND SYSTEM contient tous les titres et contenus.",
    "NAND USER contient tout le contenu installé dans la mémoire de la console.",
    "PRODINFOF",
    "NAND SAFE",
    "NAND USER",
    "NAND SYSTEM",
    "Installation USB ",
    "Démarrage de l'installation USB...",
    "Gestionnaire du contenu de la console",
    "Sélectionnez le média de stockage pour en parcourir le contenu.",
    "Gestionnaire de tickets",
    "Recherche des tickets importés en cours...",
    "Applet web",
    "La version de Goldleaf non-installé utilise l'applet WifiAuth, qui a moins de fonctionnalités.",
    "Sélectionnez une page web à parcourir à travers l'applet web.",
    "La page sélectionnée n'est pas formatée correctement.",
    "Une erreur est apparue en essayant de lancer l'applet web :",
    "Comptes utilisateurs",
    "Traitement des comptes utilisateurs en cours...",
    "Informations de la console",
    "Voir l'état de la carte SD et de la mémoire de la console.",
    "Impossible de détecter dans quel mode est lancé Goldleaf.",
    "Lancé en tant qu'homebrew NRO.",
    "Lancé en tant que titre installé.",
    "Lancé en tant que remplacement de l'écran d'accueil (qlaunch).",
    "Ce dossier est vide.",
    "Attention: accès à la mémoire de la console",
    "Êtes vous sûr de vouloir écrire ou supprimer du contenu de la mémoire de la console ?",
    "Sélectionnez le type de fichier :",
    "Package NSP",
    "Exécutable NRO",
    "ticket de contenu",
    "thème NxTheme",
    "contenu NCA",
    "fichier de contrôle NACP",
    "Image JPEG",
    "binaire",
    "texte",
    "fichier",
    "dossier",
    "Taille du fichier :",
    "Installer",
    "Lancer",
    "Importer",
    "Extraire",
    "Voir le contenu",
    "Remplacer l’icône utilisateur",
    "Voir le texte",
    "Voir hex",
    "Copier",
    "Supprimer",
    "renommer",
    "Options du fichier",
    "Installation NSP",
    "Où voulez-vous installer le NSP ?",
    "Mémoire de la console",
    "Voulez-vous ignorer la version du firmware requise par le NSP ?",
    "Il n'y a pas assez de place pour installer le NSP.",
    "Information sur le contenu du NSP :",
    "Le NSP contient un titre (base).",
    "Le NSP contient une mise à jour de titre (update).",
    "Le NSP contient un DLC.",
    "Le NSP contient un autre type de contenu.",
    "Le NSP semble être officiel.",
    "Le NSP semble être un homebrew.",
    "le NSP a un ID d'application étrangement formaté.",
    "ID d'application :",
    "Nom :",
    "Auteur :",
    "Contenu :",
    "Le NSP a un ticket à importer :",
    "Génération de la clé :",
    "Version inconnue",
    "Le NSP n'a pas de ticket.",
    "Lancement du NRO",
    "Voulez-vous fermer Goldleaf et lancer ce NRO ?",
    "Les NROs ne peuvent être lancées que si Goldleaf est lancé en tant que NRO.",
    "Import de ticket",
    "Voulez-vous importer ce ticket ?",
    "Une erreur est survenue en tentant d'importer le ticket :",
    "Installation de NxTheme",
    "Le NRO de NxThemesInstaller est introuvable. Le thème ne peut pas être installé.",
    "Nom inconnu",
    "Auteur inconnu",
    "Information de contrôle NACP :",
    "Version :",
    "Demander le compte utilisateur ?",
    "Oui",
    "Non",
    "Oui, mais le compte utilisateur doit être lié aux services Nintendo.",
    "Valeur inconnue",
    "Supporte la capture d'écran ?",
    "Supporte la capture vidéo ?",
    "Oui (manuel)",
    "Type de logo :",
    "Licencié par Nintendo",
    "Nintendo",
    "Remplacement d'icône de compte utilisateur",
    "Voulez-vous remplacer l'icône de ce compte utilisateur ? Ceci peut être risqué.",
    "L'icône utilisateur a été remplacé avec succès.",
    "Une erreur est survenue en tentant de remplacer l’icône du compte utilisateur :",
    "Lancement du Payload",
    "Voulez-vous redémarrer la console en lançant ce fichier en tant que payload ?",
    "Suppression de fichier",
    "Voulez-vous supprimer ce fichier ?",
    "Le fichier a été supprimé avec succès.",
    "Sélectionnez un nouveau nom pour renommer ce fichier.",
    "Un autre fichier ou dossier porte déjà le même nom.",
    "Une erreur est survenue en tentant de renommer ce fichier.",
    "Le fichier a été renommé avec succès.",
    "Que voulez-vous faire avec ce dossier ?",
    "Options du dossier",
    "Parcourir",
    "Renommer le dossier",
    "Une erreur est survenue en tentant de renommer le dossier :",
    "Le dossier a été renommé avec succès.",
    "Démarrage de l'installation USB du NSP...",
    "Un dossier (et tout son contenu) a été copié avec succès.",
    "Copier de fichier",
    "Un autre fichier avec le même nom existe. Voulez-vous l'écraser ?",
    "Démarrage de l'installation du NSP...",
    "Installation du NSP :",
    "Analyse de l'application...",
    "Démarrage de l'écriture du contenu...",
    "Écriture du contenu",
    "de",
    "Le NSP a été installé avec succès.",
    "Démarrage du processus de copie...",
    "Attente de la connexion USB...",
    "Branchez votre console en USB sur votre PC.",
    "Erreur de connexion USB.",
    "La connexion USB a été détectée. En attente de la requête du client sur PC...",
    "Installation USB",
    "Ce NSP a été demandé :",
    "Voulez-vous l'installer ?",
    "Vitesse moyenne :",
    "L'installation USB s'est terminé avec succès. Le client sur PC peut être fermé.",
    "Une réponse invalide a été reçue. Réessayez l'installation.",
    "Information",
    "Méta",
    "Programme",
    "Données",
    "Contrôle",
    "Documents HTML",
    "Information légales",
    "Informations sur le contenu sélectionné :",
    "Type de contenu :",
    "Titre de base",
    "DLC",
    "Mise à jour de titre (update)",
    "titre système",
    "contenu de données système",
    "autre type de contenu",
    "Taille du contenu :",
    "Numéro de version :",
    "mise à jour",
    "Le contenu a été supprimé avec succès.",
    "Une erreur est survenue en tentant de supprimer le contenu :",
    "Export de titre NSP",
    "La taille de ce titre est supérieure ou égale à 4GB. N'exportez pas si vous êtes en FAT32.",
    "Voulez-vous exporter ce titre en NSP ?",
    "Les titres NAND SYSTEM ne peuvent pas être supprimés.",
    "Voulez vous supprimer ce contenu ?",
    "Contenus de la console",
    "Cet emplacement de stockage à l'air d'être vide.",
    "Parcourir des contenus de cet emplacement.",
    "Cartouche de jeu",
    "Démarrage de l'export du titre...",
    "Accès à la base de donnée des tickets...",
    "Accès aux contenus NCA du titre...",
    "Décryptage et export du contenu...",
    "Export du contenu depuis la mémoire de la console...",
    "Construction du NSP à partir du contenu exporté...",
    "Le titre a été exporté avec succès :",
    "Une erreur est survenue en tentant d'exporter le titre:",
    "Aucun ticket n'a été trouvé sur la console.",
    "Options des tickets",
    "Informations sur le ticket :",
    "Ce ticket ne semble être utilisé par aucun titre.",
    "Ce ticket ne semble pas utilisé.",
    "Voulez-vous supprimer ce ticket ?",
    "Êtes-vous sûr de vouloir supprimer ce ticket qui semble être utilisé ?",
    "Le ticket a été supprimé avec succès.",
    "Une erreur est survenue en tentant de supprimer le ticket :",
    "Changement de pseudo",
    "Voir l'icône",
    "Suppression du compte",
    "Une erreur est survenue en tentant d'analyser le compte :",
    "Utilisateur sélectionné :",
    "Changer le pseudo de l'utilisateur",
    "Le pseudo du compte utilisateur a été changé en",
    "Une erreur est survenue en tentant de renommer le compte :",
    "Compte utilisateur",
    "Cet icône a été exporté ici :",
    "Voulez-vous supprimer ce compte ?",
    "Le compte a été supprimé avec succès.",
    "Une erreur est survenue en tentant de supprimer le compte :",
    "libre",
    "Presse-papier",
    "Voulez-vous coller le contenu du presse-papier ici ?",
    "Il n'y a rien de sélectionné pour la copie.",
    "Sélectionnez le nom du fichier à créer",
    "Un autre fichier ou dossier porte le même nom.",
    "Un fichier a été créé :",
    "Un dossier a été créé :",
    "Redémarrer ou éteindre",
    "Voulez-vous redémarrer ou éteindre la console ?",
    "Un fichier ou un dossier a été copié. Le presse-papier a été mis à jour.",
    "Redémarrer",
    "Éteindre",
    "Ok",
    "Clé du titre (titlekey);",
    "Type de signature :",
    "Taille du dossier :",
    "Sélectionnez un nouveau nom pour renommer le fichier.",
    "Écraser",
    "Le fichier a été copié avec succès.",
    "La connexion a été établie avec succès. En attente de la requête du client sur PC pour un NSP...",
    "Le client sur PC a finalisé la connexion.",
    "Information du contenu",
    "Exporter",
    "Supprimer",
    "Le contenu a été supprimé avec succès.",
    "Une erreur est survenue en tentant de supprimer le contenu :",
    "Parcourir les tickets et les tickets personnalisés.",
    "Une erreur est survenue en tentant de renommer le compte utilisateur : le nom est trop long.",
    "Sélectionnez un nom pour le nouveau dossier.",
    "Une erreur s'est produite lors de la tentative d'installation du NSP :",
    "Une erreur s'est produite lors de la recherche du NRO de NxThemesInstaller :",
    "Une erreur s'est produite lors de la tentative de suppression du fichier ou du répertoire :",
    "Une erreur s'est produite lors de la tentative de renommage du fichier ou du répertoire :",
    "Une erreur s'est produite lors de la tentative de création du fichier ou du répertoire :",
    "Une erreur s'est produite lors de la tentative de traitement des commandes USB GLUC :",
    "Le presse-papiers a été mis à jour avec le fichier sélectionné.",
    "Le presse-papiers a été mis à jour avec le répertoire sélectionné.",
    "L'image sélectionnée n'est pas une icône valide.",
    "L'image sélectionnée n'a pas les dimensions 256x256.",
    "Titre de base",
    "Mise à jour",
    "DLC",
    "Module",
    "Description",
    "Erreur",
    "avec mise à jour et DLC",
    "avec mise à jour",
    "avec DLC",
    "fichier texte",
    "fichier binaire",
    "Le contenu du NSP semble déjà installé",
    "(il peut s'agir d'une version plus ancienne du titre)",
    "Voulez-vous le réinstaller sur celui qui est déjà installé ?",
    "Le titre a été désinstallé. Sélectionnez à nouveau ce NSP pour l'installer.",
    "Impossible de supprimer le seul utilisateur de cette console.",
    "Explorer le contenu",
    "Explorez les contenus montés (carte SD, mémoire de la console...)",
    "PC distant (via USB)",
    "Options supplémentaires",
    "Définir le bit d'archive",
    "Installer tous les NSP",
    "Amiibo dump (emuiibo)",
    "Mises à jour",
    "Ce contenu a un ticket.",
    "Ce contenu n'a pas de ticket.",
    "Tickets inutilisés",
    "Goldleaf (version NRO)",
    "Goldleaf (version NSO)",
    "lancée comme une applet",
    "lancée comme une application",
    "Le navigateur web de la console n'est accessible que si Goldleaf est lancé en tant que jeu.",
    "Retirer le ticket",
    "Lancement de la détection d'amiibo...",
    "En attente de réception de l'amiibo... appuyez sur B pour annuler.",
    "Amiibo détecté : dumping",
    "au dossier emuiibo...",
    "le dump de l'amiibo est terminé.",
    "Navigateur PC distant",
    "La console n'est pas connectée à un PC. Veuillez la connecter à l'aide d'un câble USB-C.",
    "Dumper une vraie figurine amiibo à utiliser avec emuiibo (émulation amiibo)",
    "Mettre à jour Goldleaf (depuis la dernière version sur GitHub) ",
    "Le bit d'archive a été placé sur le répertoire sélectionné.",
    "Aucune connexion internet n'a été trouvée.",
    "Récupération de la dernière version sur GitHub...",
    "Accès terminé.",
    "Goldleaf est à jour.",
    "Aimeriez-vous mettre à jour Goldleaf avec la dernière version disponible ?",
    "Téléchargement de la dernière version NRO....",
    "Souhaitez-vous télécharger et installer la dernière version du forwarder de Goldleaf NSP ?",
    "Téléchargement de la dernière version NSP...",
    "Démarrer l'installation de Goldleaf NSP...",
    "Suppression de l'installation précédente de Goldleaf...",
    "Goldleaf a été mis à jour.",
    "Veuillez redémarrer afin d'utiliser la dernière version.",
    "Impossible d'obtenir la dernière version sur GitHub.",
    "Voulez-vous dumper",
    "Aucun utilisateur n'a été sélectionné. Sélectionnez-le en cliquant sur l'icône de l'utilisateur ci-dessus.",
    "Réinitialiser la version de lancement",
    "Bienvenue dans Goldleaf ! Appuyez sur - en tout temps pour obtenir de l'aide ou des informations.",
    "Annuler le lien du compte (localement)",
    "La version de lancement du titre a été réinitialisée avec succès.",
    "Une erreur s'est produite lors de la tentative de réinitialisation de la version de lancement du titre :",
    "L'utilisateur a été sélectionné avec succès.",
    "Suppression d'annuaire",
    "Souhaitez-vous supprimer ce répertoire ?",
    "Le répertoire a été supprimé avec succès.",
    "ID de compte :",
    "ID de compte Nintendo :",
    "Compte lié",
    "Déconnecter (localement)",
    "Déconnecter le compte localement",
    "Souhaitez-vous dissocier ce compte ? (Il ne sera dissocié que localement)",
    "Le compte a été dissocié avec succès. Il peut être effacé maintenant.",
    "Une erreur s'est produite lors de la tentative de dissociation du compte :",
    "Informations de compte Nintendo",
    "Statistiques de jeu spécifiques à l'utilisateur :",
    "Statistiques globales de jeu :",
    "Temps écoulé depuis la dernière partie :",
    "Temps de jeu total :",
    "Le fichier sélectionné n'est pas un NACP valide.",
    "Informations de contrôle :",
    "Appuyez sur - ou appuyez sur le bouton Aide pour ouvrir cette boîte de dialogue.",
    "Appuyez sur Y pendant la navigation pour afficher plusieurs options de dossier.",
    "Appuyez sur X pour copier/coller un fichier/répertoire.",
    "Appuyez sur + (NRO seulement) pour sortir au menu hbmenu.",
    "Appuyez sur ZL/ZR pour ouvrir la boîte de dialogue Redémarrage/Arrêt.",
    "Sélection de l'utilisateur",
    "Aucun utilisateur n'a été sélectionné. Voulez-vous en choisir un ?",
    "Impossible de sélectionner un utilisateur.",
    "Ce titre n'a pas encore été utilisé.",
    "Firmware et mises à jour",
    "Informations sur le stockage",
    "Réglages de Goldleaf",
    "Ignorer le firmware requis pour les installations",
    "Chemin externe RomFs",
    "Réglages",
    "La mise à jour sélectionnée a été exportée vers",
    "Exportation",
    "Firmware",
    "Comment voulez-vous exporter la mise à jour ?",
    "Information sur le firmware",
    "Version",
    "Hash de la version",
    "Informations sur la mise à jour en attente",
    "Vous pouvez supprimer la mise à jour en attente ici ou en démarrant sur le menu de Maintenance.",
    "Auncune mise à jour en attente n'a été trouvée sur le système.",
    "Exporter la mise à jour",
    "Supprimer la mise à jour",
    "Export en attente",
    "Supprimer la mise à jour en attente d'export",
    "Voulez-vous supprimer la mise à jour en attente d'export ?",
    "La même fonction peut-être accomplie en allant dans le menu Maintenance.",
    "La mise à jour en attente a été supprimée.",
    "Réglages de la console et de Goldleaf",
    "Réglages spécifiques de Goldleaf ou de la console",
    "Dossier",
    "Saisissez une page web...",
    "Enregistrer en tant que favori.",
    "Voulez-vous sauvegarder ceci en tant que favori .",
    "Nom du favori",
    "Les paramètres ont étés mis à jour et sauvegardés",
    "Marque-pages Web",
    "Que voulez-vous faire de ce marque-page ?",
    "Naviguer",
    "Éditer",
    "Éditer le marque-page",
    "Quel champ voulez-vous éditer ?",
    "Nom",
    "URL",
    "Nouveau nom du marque-page",
    "Nouvelle URL du marque-page",
    "Le nom du marque-page a été modifié.",
    "L'URL du marque-page a été modifié.",
    "Supprimer le marque-page",
    "Voulez-vous supprimer ce marque-page ?",
    "Le marque-page a été supprimé.",
    "Périphériques USB (ftp-usb)",
    "Périphériques USB",
    "Le module fsp-usb n'est pas présent ou n'est pas actif.",
    "Informations du périphérique USB",
    "Nombre de périphériques détectés :",
    "Explorateur de périphérique USB",
    "Démonter le contenu",
    "Êtes-vous sûr de démonter ce contenu",
    "Contenu démonter correctement",
    "Sélectionnez un fichier du PC",
    "Données de sauvegarde du contenu",
    "Cela ne peut être effectué qu'avec des titles (et non des mise à jour ou des DLC).",
    "Cela ne peut être effectué avec des titres système.",
    "Sélectionnez d'abord un compte pour en explorer les données de sauvegarde.",
    "Les données de sauvegarde ont été montées. Explorez le contenu dans la section navigation.",
    "Une erreur s'est produite lors du montage des données de sauvegarde de ce titre pour l'utilisateur :",
    "Monter les données de sauvegarde",
    "Visualiser la mise à jour",
    "Mettre à jour les informations",
    "Version de la mise à jour :",
    "Support de exFAT ?",
    "Continuer (validation)",
    "Validation de la mise à jour",
    "La mise à jour est valide.",
    "Une erreur s'est produite lors de la validation de la mise à jour :",
    "Continuer (installation)",
    "Installer la mise à jour",
    "Voulez-vous installer une mise à jour contenant le support de exFAT ?",
    "Préparation de la mise à jour...",
    "Installation de la mise à jour...",
    "Une erreur s'est produite lors de la mise en place de la mise à jour :",
    "Une erreur s'est produite lors de la préparation de la mise à jour :",
    "Une erreur s'est produite lors de l'application de la mise à jour :",
    "La mise à jour s'est installée avec succès.",
    "La console doit être redémarrée.",
    "Ce dossier ne contient pas de mise à jour valide.",
    "Que voulez-vous faire avec ce disque USB?",
    "Ejecter en toute sécurité",
    "Le disque USB a été éjecté avec succès.",
    "Impossible d’éjecter le disque USB en toute sécurité...",
    "Exportation avec certificat",
    "Le ticket a été exporté avec succès :",
    "Afin d'éviter les risques, la suppression des tickets utilisés n'est pas autorisée"
]